[
  {
    "plantId": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant, also known as Sansevieria or Mother-in-Law’s Tongue, is one of the most resilient and popular indoor plants, loved for its striking appearance and air-purifying properties. Its tall, upright leaves feature bold green and yellow variegation, creating a modern and architectural look that enhances any room, from minimalist apartments to cozy offices. Beyond its visual appeal, the Snake Plant is a natural air purifier that removes harmful toxins such as formaldehyde, benzene, and xylene, helping to improve indoor air quality. It thrives in both low and bright indirect light, tolerates irregular watering, and requires very little maintenance. This makes it an excellent choice for busy plant owners or beginners. The Snake Plant also releases oxygen at night, which can help improve sleep quality. Durable, stylish, and incredibly forgiving, it’s the perfect companion for those who want beauty, health benefits, and low effort all in one plant.",
    "image": "https://i.ibb.co.com/B5gXjRTn/Snake-Plant1.png",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 2,
    "plantName": "Peace Lily",
    "category": "Flowering Plant",
    "price": 22,
    "rating": 4.7,
    "availableStock": 8,
    "careLevel": "Medium",
    "description": "The Peace Lily is a graceful indoor plant admired for its elegant white blooms and lush green foliage. Known for its serene beauty and calming presence, it brings a touch of tranquility to any interior space. This plant naturally cleanses the air by filtering toxins like ammonia, benzene, and formaldehyde, making it both decorative and functional. The Peace Lily thrives in low to medium light conditions, perfect for shaded corners or office desks. Its glossy leaves and long-lasting white flowers add an element of sophistication to home décor. Although it prefers slightly moist soil, it’s forgiving if occasionally neglected. Regular misting and moderate watering keep it looking vibrant year-round. As a symbol of peace, purity, and renewal, the Peace Lily not only enhances your environment but also promotes a sense of relaxation and well-being, making it an ideal plant for homes, hospitals, and workspaces.",
    "image": "https://i.ibb.co.com/270f8kdR/images2.jpg",
    "providerName": "Green Haven"
  },
  {
    "plantId": 3,
    "plantName": "Aloe Vera",
    "category": "Succulent",
    "price": 15,
    "rating": 4.6,
    "availableStock": 15,
    "careLevel": "Easy",
    "description": "Aloe Vera is a well-loved succulent famous for both its decorative appeal and its powerful medicinal properties. With thick, fleshy leaves filled with soothing gel, it has been used for centuries to treat minor burns, cuts, and skin irritations. This hardy plant thrives in bright, indirect light and requires minimal watering, making it perfect for beginners or those with busy schedules. Its architectural shape adds a touch of modern greenery to any room, from kitchens to windowsills. Aloe Vera not only beautifies your home but also contributes to better indoor air quality by filtering harmful substances. It stores water in its leaves, allowing it to survive long dry periods without much care. Its resilience, healing nature, and low-maintenance requirements make Aloe Vera a must-have houseplant for those seeking both style and wellness benefits in a single living accent.",
    "image": "https://i.ibb.co.com/jvZJy9ZT/Aloe-Vare3.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 4,
    "plantName": "Money Plant",
    "category": "Air Purifier",
    "price": 16,
    "rating": 4.9,
    "availableStock": 20,
    "careLevel": "Easy",
    "description": "The Money Plant, also known as Pothos or Devil’s Ivy, is a classic favorite among indoor gardeners for its beautiful heart-shaped leaves and easy-growing nature. This fast-growing vine is believed to bring luck, wealth, and positive energy to its surroundings, making it a popular choice for homes and offices. Its trailing vines can be grown in soil or water and trained to climb or hang elegantly from pots and baskets. The Money Plant thrives in low to bright indirect light and tolerates occasional neglect, which makes it ideal for beginners. Beyond its beauty, it’s a natural air purifier that helps remove harmful indoor toxins, improving air quality. With minimal maintenance and endless versatility in placement, the Money Plant effortlessly blends into any décor while symbolizing prosperity, growth, and harmony in your living space.",
    "image": "https://i.ibb.co.com/3m0SjyGS/images4.jpg",
    "providerName": "Leaf & Life"
  },
  {
    "plantId": 5,
    "plantName": "ZZ Plant",
    "category": "Indoor Plant",
    "price": 25,
    "rating": 4.8,
    "availableStock": 12,
    "careLevel": "Easy",
    "description": "The ZZ Plant, or Zamioculcas zamiifolia, is a low-maintenance indoor plant known for its glossy, deep green leaves and remarkable ability to survive neglect. It thrives in low light and dry conditions, making it one of the easiest plants for beginners or offices with limited sunlight. The ZZ Plant is drought-tolerant and can go weeks without watering, yet remains vibrant and healthy. It’s also an effective air purifier, removing toxins and adding a sense of freshness to the room. Its symmetrical, waxy foliage creates a contemporary look that fits perfectly in modern interiors. Highly resilient, it resists pests and diseases while continuing to grow slowly throughout the year. Whether placed on a desk or in a shaded corner, the ZZ Plant brings elegance, calm, and life to any indoor environment with almost zero effort.",
    "image": "https://i.ibb.co.com/BVGSxJMS/zz-plant5.webp",
    "providerName": "Green Haven"
  },
  {
    "plantId": 6,
    "plantName": "Areca Palm",
    "category": "Air Purifier",
    "price": 28,
    "rating": 4.7,
    "availableStock": 9,
    "careLevel": "Medium",
    "description": "The Areca Palm, often called the Butterfly Palm, is a stunning indoor plant that instantly adds tropical charm to your home or workspace. With its long, feathery fronds and lush green appearance, it creates a refreshing atmosphere reminiscent of a natural oasis. This plant is highly effective at purifying indoor air, removing carbon dioxide and harmful toxins while releasing fresh oxygen. It thrives in bright, indirect light and enjoys regular watering to keep the soil lightly moist. The Areca Palm also helps maintain humidity levels, which is great for skin and respiratory health. Its graceful leaves sway gently with the air, bringing a sense of calm and movement to any room. Perfect for large corners or living areas, the Areca Palm is not just decorative but also beneficial for overall well-being and air quality.",
    "image": "https://i.ibb.co.com/Cyw582L/images6.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 7,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 14,
    "rating": 4.5,
    "availableStock": 18,
    "careLevel": "Easy",
    "description": "The Spider Plant is one of the most adaptable and forgiving houseplants, perfect for beginners or anyone looking to add greenery without much maintenance. It’s easily recognizable by its long, arching leaves striped with shades of green and white, and its ability to produce baby plantlets known as 'spiderettes.' These offshoots can be propagated effortlessly to grow new plants. The Spider Plant thrives in bright, indirect light but can also tolerate lower light conditions. It’s particularly known for purifying indoor air by absorbing harmful substances like carbon monoxide and xylene. This hardy plant prefers evenly moist soil and occasional misting. With its lively, cascading growth and air-cleaning properties, the Spider Plant brings freshness, beauty, and vitality to any indoor environment year-round.",
    "image": "https://i.ibb.co.com/DPTVKYVR/spider-plant-care-7.jpg",
    "providerName": "Leaf & Life"
  },
  {
    "plantId": 8,
    "plantName": "Rubber Plant",
    "category": "Indoor Plant",
    "price": 26,
    "rating": 4.6,
    "availableStock": 7,
    "careLevel": "Medium",
    "description": "The Rubber Plant, scientifically known as Ficus elastica, is a bold and elegant houseplant admired for its large, glossy leaves and architectural form. Its thick, deep green foliage makes it a striking statement piece that complements modern interiors beautifully. The Rubber Plant thrives in bright, indirect light and prefers slightly moist but well-drained soil. It’s also effective at removing airborne toxins, contributing to a cleaner and fresher living environment. This plant is relatively easy to care for once established and can grow into an impressive indoor tree with the right conditions. Regularly wiping its leaves helps it absorb more light and maintain its shiny appearance. The Rubber Plant adds sophistication, structure, and natural elegance to homes and offices, making it a timeless favorite for plant lovers.",
    "image": "https://i.ibb.co.com/nqMKtHsM/20220326068.jpg",
    "providerName": "BloomNest"
  },
  {
    "plantId": 9,
    "plantName": "Boston Fern",
    "category": "Indoor Plant",
    "price": 20,
    "rating": 4.4,
    "availableStock": 14,
    "careLevel": "Medium",
    "description": "The Boston Fern is a lush and classic indoor plant loved for its delicate, feathery fronds and vibrant green color. It adds softness and texture to any room while naturally purifying the air. This plant thrives in humid environments and prefers indirect light, making it perfect for bathrooms, shaded balconies, or kitchens. Regular misting and consistently moist soil help maintain its fullness and color. The Boston Fern not only enhances visual appeal but also increases humidity, which benefits skin and respiratory health. Its graceful arching fronds bring a touch of natural elegance to homes, offices, or patios. With the right care and environment, the Boston Fern can grow into a lush, eye-catching centerpiece that radiates freshness and life throughout your space.",
    "image": "https://i.ibb.co.com/Q7TRCtJT/How-to-Water-9.jpg",
    "providerName": "Green Haven"
  },
  {
    "plantId": 10,
    "plantName": "Jade Plant",
    "category": "Succulent",
    "price": 17,
    "rating": 4.7,
    "availableStock": 11,
    "careLevel": "Easy",
    "description": "The Jade Plant, often called the Money Tree, is a charming succulent symbolizing prosperity and good fortune. Its small, thick, oval-shaped leaves store water, allowing it to thrive with minimal care. The Jade Plant prefers bright, indirect sunlight and infrequent watering, making it ideal for busy or beginner gardeners. Its compact size and glossy foliage make it a perfect tabletop or windowsill plant. Beyond its beauty, it’s believed to attract positive energy and financial growth according to Feng Shui principles. This long-lived plant can grow for decades, becoming more impressive with age. With its sculptural form, shiny leaves, and symbolic significance, the Jade Plant brings both elegance and good vibes to any space.",
    "image": "https://i.ibb.co.com/SwqPnWJ0/images10.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 11,
    "plantName": "Lucky Bamboo",
    "category": "Indoor Plant",
    "price": 12,
    "rating": 4.5,
    "availableStock": 25,
    "careLevel": "Easy",
    "description": "Lucky Bamboo is a popular indoor plant admired for its graceful appearance and symbolic meaning of prosperity and harmony. Despite its name, it is not a true bamboo but a type of Dracaena. It can be grown in water-filled containers or soil, making it extremely versatile and low maintenance. Lucky Bamboo thrives in low to medium light, requiring only occasional water changes or light misting. Its upright green stems and spiral shapes add a unique decorative touch to desks, offices, or home corners. In Feng Shui, it’s believed to bring positive energy, wealth, and good fortune to its surroundings. Beautiful, easy to grow, and deeply symbolic, Lucky Bamboo is a timeless plant that represents balance, luck, and peaceful living.",
    "image": "https://i.ibb.co.com/Gv4j57XF/Lucky-Bamboo-Plant11.webp",
    "providerName": "Leaf & Life"
  },
  {
    "plantId": 12,
    "plantName": "Fiddle Leaf Fig",
    "category": "Indoor Tree",
    "price": 35,
    "rating": 4.9,
    "availableStock": 6,
    "careLevel": "Medium",
    "description": "The Fiddle Leaf Fig is a designer-favorite indoor tree known for its large, violin-shaped leaves and dramatic visual appeal. This plant instantly elevates the look of any space, fitting perfectly into modern, minimalist, or bohemian interiors. It thrives in bright, indirect sunlight and prefers consistent watering with good drainage. The Fiddle Leaf Fig improves air quality while making a bold green statement in living rooms, offices, or lobbies. It requires a bit more attention than some houseplants, but the results are rewarding — with proper care, it can grow tall and majestic. Regular dusting and occasional pruning keep it healthy and vibrant. Its sculptural beauty, lush foliage, and impressive stature make the Fiddle Leaf Fig one of the most sought-after indoor plants for stylish home décor.",
    "image": "https://i.ibb.co.com/qFydrbcJ/7d6a85e5e12.web",
    "providerName": "BloomNest"
  }
]
